In [1]:
import sqlite3
conn = sqlite3.connect('university.db')
cursor = conn.cursor()

In [2]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS Students (
    StudentID INTEGER PRIMARY KEY,
    FirstName TEXT NOT NULL,
    LastName TEXT NOT NULL,
    DateOfBirth DATE,
    Email TEXT
)
''')
cursor.execute('''
CREATE TABLE IF NOT EXISTS Courses (
    CourseID INTEGER PRIMARY KEY,
    CourseName TEXT NOT NULL,
    Instructor TEXT
)
''')
cursor.execute('''
CREATE TABLE IF NOT EXISTS Enrollments (
    EnrollmentID INTEGER PRIMARY KEY,
    StudentID INTEGER NOT NULL,
    CourseID INTEGER NOT NULL,
    EnrollmentDate DATE,
    FOREIGN KEY (StudentID) REFERENCES Students(StudentID),
    FOREIGN KEY (CourseID) REFERENCES Courses(CourseID)
)
''')
conn.commit()

In [4]:
cursor.execute('DELETE FROM Students')
conn.commit()

In [5]:
cursor.execute('SELECT * FROM Students')
print(cursor.fetchall())

[]

In [6]:
cursor.executemany('''
INSERT INTO Students (StudentID, FirstName, LastName, DateOfBirth, Email)
VALUES (?, ?, ?, ?, ?)
''', [
    (1, 'Ali', 'Ahmadi', '1995-04-12', 'ali.ahmadi@example.com'),
    (2, 'Sara', 'Karimi', '1998-08-22', 'sara.karimi@example.com'),
    (3, 'Reza', 'Hosseini', '2000-02-15', 'reza.hosseini@example.com')
])

conn.commit()
print("Students data inserted successfully.")

Students data inserted successfully.

In [7]:
cursor.execute('SELECT * FROM Students')
print(cursor.fetchall())

[(1, 'Ali', 'Ahmadi', '1995-04-12', 'ali.ahmadi@example.com'), (2, 'Sara', 'Karimi', '1998-08-22', 'sara.karimi@example.com'), (3, 'Reza', 'Hosseini', '2000-02-15', 'reza.hosseini@example.com')]

In [11]:
cursor.execute('DELETE FROM Courses')
conn.commit()

In [12]:
cursor.executemany('''
INSERT INTO Courses (CourseID, CourseName, Instructor)
VALUES (?, ?, ?)
''', [
    (101, 'Introduction to Java', 'Dr. Smith'),
    (102, 'Database Systems', 'Dr. Johnson'),
    (103, 'Data Structures', 'Dr. Brown')
])

conn.commit()
print("Courses data inserted successfully.")

Courses data inserted successfully.

In [13]:
cursor.execute('SELECT * FROM Courses')
print(cursor.fetchall())

[(101, 'Introduction to Java', 'Dr. Smith'), (102, 'Database Systems', 'Dr. Johnson'), (103, 'Data Structures', 'Dr. Brown')]

In [15]:
cursor.execute('DELETE FROM Enrollments')
conn.commit()
print("All records from Enrollments table deleted.")

All records from Enrollments table deleted.

In [16]:
cursor.executemany('''
INSERT INTO Enrollments (EnrollmentID, StudentID, CourseID, EnrollmentDate)
VALUES (?, ?, ?, ?)
''', [
    (1, 1, 101, '2024-01-10'),
    (2, 1, 102, '2024-01-11'),
    (3, 2, 101, '2024-01-12'),
    (4, 3, 103, '2024-01-20')
])

conn.commit()
print("Enrollments data inserted successfully.")

Enrollments data inserted successfully.

In [17]:
cursor.execute('SELECT * FROM Students')
print("Students Table:")
print(cursor.fetchall())

cursor.execute('SELECT * FROM Courses')
print("\nCourses Table:")
print(cursor.fetchall())

cursor.execute('SELECT * FROM Enrollments')
print("\nEnrollments Table:")
print(cursor.fetchall())

Students Table:
[(1, 'Ali', 'Ahmadi', '1995-04-12', 'ali.ahmadi@example.com'), (2, 'Sara', 'Karimi', '1998-08-22', 'sara.karimi@example.com'), (3, 'Reza', 'Hosseini', '2000-02-15', 'reza.hosseini@example.com')]

Courses Table:
[(101, 'Introduction to Java', 'Dr. Smith'), (102, 'Database Systems', 'Dr. Johnson'), (103, 'Data Structures', 'Dr. Brown')]

Enrollments Table:
[(1, 1, 101, '2024-01-10'), (2, 1, 102, '2024-01-11'), (3, 2, 101, '2024-01-12'), (4, 3, 103, '2024-01-20')]

In [19]:
cursor.execute('''
SELECT Students.FirstName || ' ' ||  Students.LastName AS StudentName, 
       COUNT(Enrollments.CourseID) AS CourseCount
FROM Students
LEFT JOIN Enrollments ON Students.StudentID = Enrollments.StudentID
GROUP BY Students.StudentID
''')
print("Student Enrollments:")
print(cursor.fetchall())

Student Enrollments:
[('Ali Ahmadi', 2), ('Sara Karimi', 1), ('Reza Hosseini', 1)]

In [20]:
cursor.execute('''
DELETE FROM Students
WHERE StudentID IN (
    SELECT Students.StudentID
    FROM Students
    LEFT JOIN Enrollments ON Students.StudentID = Enrollments.StudentID
    GROUP BY Students.StudentID
    HAVING COUNT(Enrollments.CourseID) < 2
)
''')
conn.commit()
print("Students with less than 2 courses removed.")

Students with less than 2 courses removed.

In [21]:
cursor.execute('''
UPDATE Courses
SET CourseName = REPLACE(CourseName, 'Java', 'Python')
WHERE CourseName LIKE '%Java%'
''')
conn.commit()
print("Courses updated successfully.")

Courses updated successfully.

In [22]:
cursor.execute('SELECT * FROM Courses')
print("Updated Courses Table:")
print(cursor.fetchall())

Updated Courses Table:
[(101, 'Introduction to Python', 'Dr. Smith'), (102, 'Database Systems', 'Dr. Johnson'), (103, 'Data Structures', 'Dr. Brown')]

In [23]:
conn.close()
print("Database connection closed.")

Database connection closed.